# ShapesNotMatch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..ShapesNotMatch Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Shapes do not match. A connection could not be made.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ShapesNotMatch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ShapesNotMatch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ShapesNotMatch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace